## staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
21:34:42.038 STDOUT terraform:   + create
21:34:42.038 STDOUT terraform: Terraform planned the following actions, but then encountered a problem:
21:34:42.038 STDOUT terraform:   # aws_quicksight_refresh_schedule.notifications-refreshed will be created
21:34:42.038 STDOUT terraform:   + resource "aws_quicksight_refresh_schedule" "notifications-refreshed" {
21:34:42.038 STDOUT terraform:       + arn            = (known after apply)
21:34:42.038 STDOUT terraform:       + aws_account_id = (known after apply)
21:34:42.038 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
21:34:42.039 STDOUT terraform:       + id             = (known after apply)
21:34:42.039 STDOUT terraform:       + region         = "ca-central-1"
21:34:42.039 STDOUT terraform:       + schedule_id    = "schedule-notifications"
21:34:42.039 STDOUT terraform:       + schedule {
21:34:42.039 STDOUT terraform:           + refresh_type          = "INCREMENTAL_REFRESH"
21:34:42.039 STDOUT terraform:           + start_after_date_time = (known after apply)
21:34:42.039 STDOUT terraform:           + schedule_frequency {
21:34:42.039 STDOUT terraform:               + interval        = "DAILY"
21:34:42.039 STDOUT terraform:               + time_of_the_day = "07:50"
21:34:42.039 STDOUT terraform:               + timezone        = (known after apply)
21:34:42.039 STDOUT terraform:             }
21:34:42.039 STDOUT terraform:         }
21:34:42.039 STDOUT terraform:     }
21:34:42.039 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
21:33:43.996 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
21:34:42.039 STDERR terraform: Error: expected type to be one of ["STRING" "INTEGER" "DECIMAL" "DATETIME" "BIT" "BOOLEAN" "JSON"], got DECIMAL-FLOAT
21:34:42.039 STDERR terraform:   with aws_quicksight_data_set.notifications_refreshed,
21:34:42.039 STDERR terraform:   on dataset_notifications_refreshed.tf line 5, in resource "aws_quicksight_data_set" "notifications_refreshed":
21:34:42.039 STDERR terraform:    5: resource "aws_quicksight_data_set" "notifications_refreshed" {
21:34:42.040 STDERR terraform: Error: expected type to be one of ["STRING" "INTEGER" "DECIMAL" "DATETIME" "BIT" "BOOLEAN" "JSON"], got DECIMAL-FLOAT
21:34:42.040 STDERR terraform:   with aws_quicksight_data_set.notifications_refreshed,
21:34:42.040 STDERR terraform:   on dataset_notifications_refreshed.tf line 5, in resource "aws_quicksight_data_set" "notifications_refreshed":
21:34:42.040 STDERR terraform:    5: resource "aws_quicksight_data_set" "notifications_refreshed" {
21:34:42.110 ERROR  terraform invocation failed in ./.terragrunt-cache/2hw_oXfQuoNLcJYlpM2oTZqPdpY/ziUKr5pa_JoeDZ3wgSbieuIpHJE/quicksight
21:34:42.110 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/2hw_oXfQuoNLcJYlpM2oTZqPdpY/ziUKr5pa_JoeDZ3wgSbieuIpHJE/quicksight
  
  Error: expected type to be one of ["STRING" "INTEGER" "DECIMAL" "DATETIME" "BIT" "BOOLEAN" "JSON"], got DECIMAL-FLOAT
  
    with aws_quicksight_data_set.notifications_refreshed,
    on dataset_notifications_refreshed.tf line 5, in resource "aws_quicksight_data_set" "notifications_refreshed":
     5: resource "aws_quicksight_data_set" "notifications_refreshed" {
  
  
  Error: expected type to be one of ["STRING" "INTEGER" "DECIMAL" "DATETIME" "BIT" "BOOLEAN" "JSON"], got DECIMAL-FLOAT
  
    with aws_quicksight_data_set.notifications_refreshed,
    on dataset_notifications_refreshed.tf line 5, in resource "aws_quicksight_data_set" "notifications_refreshed":
     5: resource "aws_quicksight_data_set" "notifications_refreshed" {
  
  
  exit status 1


```

</details>

